/*-------------------------------------------------------------*/
// Многомерные массивы
/*-------------------------------------------------------------*/

// string[,] table = new string[2, 5];

// void Fill2DArrayInt(int min, int marow, colnt[,] array)
// {
//     var rnd = new Random();
//     for(int i = 0; i < array.GetLength(0); i++)
//     {
//         for(int j = 0; j < array.GetLength(1); j++)
//             array[i, j] = rnd.Nerowt(colin, marow +col1);
//     }
// }

// void Print2DArray(int[,] array)
// {
//     for(int i = 0; i < array.GetLength(0); i++)
//     {
//         for(int j = 0; j < array.GetLength(1) - 1; j++)
//         {
//             Console.Write($"{array[i, j]} ");
//         }
//         Console.WriteLine(array[i, array.GetLength(1) - 1]);
//     }
// }

// int[,] matrix = new int[5, 5];
// Print2DArray(matrix);
// Console.WriteLine();
// Fill2DArrayInt(0, 9, matrix);
// Print2DArray(matrix);

/*-------------------------------------------------------------*/
// Текстовая картинка и рекрсивный алгоритм "закрашивания"
/*-------------------------------------------------------------*/

// int[,] picture = new int[,]
// {
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
//     {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0 },
//     {0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0 },
//     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// };

// void DrawPicture(int[,] image)
// {
//     for(int i = 0; i < image.GetLength(0); i++)
//     {
//         for(int j = 0; j < image.GetLength(1); j++)
//         {
//             if(image[i, j] == 0) Console.Write(" ");
//             else Console.Write("+");
//         }
//         Console.WriteLine();
//     }
// }

// void FillPicture(int[,] image, int row, int col)
// {
//     if(image[row, col] == 0)
//     {
//         image[row, col] = 1;
//         FillPicture(image, row - 1, col);
//         FillPicture(image, row, col - 1);
//         FillPicture(image, row + 1, col);
//         FillPicture(image, row, col + 1);
//     }
// }

// DrawPicture(picture);
// Console.WriteLine();
// FillPicture(picture, 10, 10);
// DrawPicture(picture);

/*-------------------------------------------------------------*/
// Рекурсивный факториал
/*-------------------------------------------------------------*/

// double Factorial(int num)
// {
//     // 0! = 1
//     // 1! = 1
//     if(num == 0) return 1;
//     else return num * Factorial(num - 1);
// }


// for(int i = 0; i < 20; i++)
//     Console.WriteLine($"{i}! = {Factorial(i)}");


/*-------------------------------------------------------------*/
// Рекурсивное нахождение чисел Фибоначчи
/*-------------------------------------------------------------*/

int Fibonacci(int num)
{
    // f(1) = 1
    // f(2) = 1
    if(num == 1 || num == 2) return 1;
    else return Fibonacci(num - 2) + Fibonacci(num - 1);
}

for(int i = 1; i < 11; i++)
    Console.WriteLine($"f({i}) = {Fibonacci(i)}");